# Занятие 5 упражнение 7
# Создать вручную и заполнить несколькими строками текстовый файл, в котором каждая строка будет содержать данные о фирме: название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила убытки, в расчёт средней прибыли её не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить её в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
# Подсказка: использовать менеджер контекста.

f = open('firms.txt', 'r', encoding='utf-8')  # мне проще без менеджера
base = [x[:-1].split() for x in f]
f.close()
firms = {}
index = 0
summa = 0
for company in base:
    x = int(company[2])-int(company[3])
    if x > 0:
        firms[company[0]] = x
        index += 1
        summa += x

firms['average_profit'] = int(summa/index)

print(firms)







